# Creating value ranges
## calculates frequency distribution of properties (rooms)

In [1]:
import pandas as pd

data = pd.read_csv('data/aluguel.csv', sep = ';')
data.head(10)

          Tipo                   Bairro  Quartos  ...   IPTU  Valor m2  Tipo Agregado
0  Apartamento                   Centro        1  ...   20.0     53.33    Apartamento
1  Apartamento             Higienópolis        1  ...    0.0     16.67    Apartamento
2  Apartamento                 Cachambi        2  ...   17.0     26.00    Apartamento
3  Apartamento                   Grajaú        2  ...   74.0     21.43    Apartamento
4  Apartamento      Lins de Vasconcelos        3  ...   14.0     16.67    Apartamento
5  Apartamento               Copacabana        1  ...   50.0     50.00    Apartamento
6  Apartamento  Freguesia (Jacarepaguá)        3  ...   28.0     17.59    Apartamento
7  Apartamento          Barra da Tijuca        2  ...  147.0     25.37    Apartamento
8  Apartamento                   Tijuca        2  ...  138.0     17.27    Apartamento
9  Apartamento                   Olaria        3  ...    0.0     14.71    Apartamento

[10 rows x 11 columns]

In [3]:
# count properties with 1 or 2  rooms
# count properties with 3 or 4  rooms
# count properties with 5 or 6  rooms
# count properties with 7 or more rooms

classes = [0, 2, 4, 6, 100]

rooms = pd.cut(data['Quartos'], classes)
rooms

0        (0.0, 2.0]
1        (0.0, 2.0]
2        (0.0, 2.0]
3        (0.0, 2.0]
4        (2.0, 4.0]
            ...
19826    (0.0, 2.0]
19827    (0.0, 2.0]
19828    (0.0, 2.0]
19829    (0.0, 2.0]
19830           NaN
Name: Quartos, Length: 19831, dtype: category
Categories (4, interval[int64]): [(0, 2] < (2, 4] < (4, 6] < (6, 100]]

In [4]:
pd.value_counts(rooms)

(0, 2]      11074
(2, 4]       8094
(4, 6]        470
(6, 100]       36
Name: Quartos, dtype: int64

In [8]:
labels = ['1 and 2 rooms', '3 and 4 rooms', '5 and 6 rooms', '7 rooms or more']
rooms = pd.cut(data['Quartos'], classes, labels=labels)
pd.value_counts(rooms)

1 and 2 rooms      11074
3 and 4 rooms       8094
5 and 6 rooms        470
7 rooms or more       36
Name: Quartos, dtype: int64

In [10]:
rooms = pd.cut(data['Quartos'], classes, labels=labels, include_lowest=True)
pd.value_counts(rooms)

1 and 2 rooms      11231
3 and 4 rooms       8094
5 and 6 rooms        470
7 rooms or more       36
Name: Quartos, dtype: int64